{
  "_name_or_path": "ckpts/opt-model",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "OPTForCausalLM"
  ],
  "auto_map": {
    "AutoModelForCausalLM": "modeling_opt_flex.OPTForCausalLM"
  },
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "do_layer_norm_before": true,
  "dropout": 0.1,
  "eos_token_id": 2,
  "ffn_dim": 8192,
  "hidden_size": 2048,
  "init_std": 0.02,
  "layerdrop": 0.0,
  "max_position_embeddings": 2048,
  "model_type": "opt",
  "num_attention_heads": 32,
  "pad_token_id": 1,
  "prefix": "</s>",
  "torch_dtype": "float16",
  "transformers_version": "4.21.0.dev0",
  "use_cache": true,
  "vocab_size": 50272,
  "word_embed_proj_dim": 2048,

  "num_hidden_layers": 22,
  "num_flex_hidden_layers": 2,
  "attn_softmax_scale": 100,

  "scene_token_num": 512,
  "scene_token_sample_radius": 0.5,
  "scene_token_sample_num_per_ball": 128,

  "region_radius": 0.5,
  "region_sample_num": 5000,
  "region_token_sample_num": 32,
  "region_token_sample_radius": 0.02,
  "region_token_sample_num_per_ball": 64,

  "use_flex_layer": true

}
